# Data Cleaning and Preprocessing

**Dataset used: Kaggle --> Mall Customer Segmentation Data**

## Load the libraries

In [1]:
import numpy as np
import pandas as pd

## Load the dataset

In [2]:
df = pd.read_csv('Data/Mall_Customers.csv')

## Inspect the data

In [7]:
df.shape

(200, 5)

In [3]:
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [5]:
df.tail()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [10]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [12]:
# df has no null values

## Checking missing values

In [13]:
df.dropna()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [ ]:
# no missing values in the df

## Check Duplicates

In [17]:
df.drop_duplicates()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [ ]:
# no duplicates in the df

## Inspect unique values

In [33]:
# Unique Values in Each Column

for column in df.columns:
    unique_values = df[column].unique()
    print(f"Column: {column}")
    print(f"Number of Unique Values: {len(unique_values)}")
    print(f"Sample Unique Values: {unique_values[:5]}\n")  # Show only first 5

Column: CustomerID
Number of Unique Values: 200
Sample Unique Values: [1 2 3 4 5]

Column: Gender
Number of Unique Values: 2
Sample Unique Values: ['male' 'female']

Column: Age
Number of Unique Values: 51
Sample Unique Values: [19 21 20 23 31]

Column: Annual Income (k$)
Number of Unique Values: 64
Sample Unique Values: [15 16 17 18 19]

Column: Spending Score (1-100)
Number of Unique Values: 84
Sample Unique Values: [39 81  6 77 40]

## Standardize text in categorical columns

In [36]:
df['Gender'].str.strip().str.lower()

0        male
1        male
2      female
3      female
4      female
        ...
195    female
196    female
197      male
198      male
199      male
Name: Gender, Length: 200, dtype: object

In [37]:
df['Gender'] = df['Gender'].str.strip().str.lower()

## Standardize columns

In [42]:
# Clean column names

df.columns.str.strip().str.lower().str.replace(' ', '_')

Index(['customerid', 'gender', 'age', 'annual_income_(k$)',
       'spending_score_(1-100)'],
      dtype='object')

In [43]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')

In [46]:
# Check and fix data types

df['annual_income_(k$)'] = df['annual_income_(k$)'].astype(float)
df['spending_score_(1-100)'] = df['spending_score_(1-100)'].astype(float)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customerid              200 non-null    int64
 1   gender                  200 non-null    object
 2   age                     200 non-null    int64
 3   annual_income_(k$)      200 non-null    float64
 4   spending_score_(1-100)  200 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 7.9+ KB

## Save the cleaned file

In [48]:
df.to_csv('Data/mall_customers_cleaned.csv')

In [49]:
df

     customerid  gender  age  annual_income_(k$)  spending_score_(1-100)
0             1    male   19                15.0                    39.0
1             2    male   21                15.0                    81.0
2             3  female   20                16.0                     6.0
3             4  female   23                16.0                    77.0
4             5  female   31                17.0                    40.0
..          ...     ...  ...                 ...                     ...
195         196  female   35               120.0                    79.0
196         197  female   45               126.0                    28.0
197         198    male   32               126.0                    74.0
198         199    male   32               137.0                    18.0
199         200    male   30               137.0                    83.0

[200 rows x 5 columns]